### Terraform Plan for `dev` Environment

<details>
<summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_artifact_registry_repository.frontend will be updated in-place
  ~ resource "google_artifact_registry_repository" "frontend" {
        id                     = "projects/web-app-demo-dev/locations/europe-west1/repositories/frontend"
        name                   = "frontend"
        # (14 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_v2_service.backend will be updated in-place
  ~ resource "google_cloud_run_v2_service" "backend" {
      - client                  = "gcloud" -> null
      - client_version          = "557.0.0" -> null
        id                      = "projects/web-app-demo-dev/locations/europe-west1/services/backend"
        name                    = "backend"
        # (32 unchanged attributes hidden)

      ~ template {
          ~ service_account                  = "333429925065-compute@developer.gserviceaccount.com" -> "backend-sa@web-app-demo-dev.iam.gserviceaccount.com"
            # (10 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_v2_service.frontend will be updated in-place
  ~ resource "google_cloud_run_v2_service" "frontend" {
      - client                  = "gcloud" -> null
      - client_version          = "557.0.0" -> null
        id                      = "projects/web-app-demo-dev/locations/europe-west1/services/frontend"
        name                    = "frontend"
        # (32 unchanged attributes hidden)

      ~ template {
          ~ service_account                  = "333429925065-compute@developer.gserviceaccount.com" -> "frontend-sa@web-app-demo-dev.iam.gserviceaccount.com"
            # (10 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_service_account.backend will be created
  + resource "google_service_account" "backend" {
      + account_id   = "backend-sa"
      + description  = "Custom service account for the backend Cloud Run service with minimal IAM permissions"
      + disabled     = false
      + display_name = "Backend Cloud Run Service Account"
      + email        = "backend-sa@web-app-demo-dev.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:backend-sa@web-app-demo-dev.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "web-app-demo-dev"
      + unique_id    = (known after apply)
    }

  # google_service_account.frontend will be created
  + resource "google_service_account" "frontend" {
      + account_id   = "frontend-sa"
      + description  = "Custom service account for the frontend Cloud Run service with minimal IAM permissions"
      + disabled     = false
      + display_name = "Frontend Cloud Run Service Account"
      + email        = "frontend-sa@web-app-demo-dev.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:frontend-sa@web-app-demo-dev.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "web-app-demo-dev"
      + unique_id    = (known after apply)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

```

</details>

*Pusher: @Copilot, Action: `pull_request`, Working Directory: `infrastructure/env`, Workflow: `Pull Request`*